Repository: Mohamed-Emad1/HaramFilter
Catalog: lib/l10n/intl_*.arb
Languages: ar

# onboardingTitle
source: Smart Detection
ar: الكشف الذكي

# onboardingSubtitle
source: Automatically scan UI content to block haram images and videos.
ar: قم بمسح محتوى الواجهة تلقائيًا لحظر الصور والفيديوهات المحرمة.

source: Next
ar: التالي

source: Get started
ar: ابدأ الآن

# onboarding_Second_Title
source: Real-time AI Filtering
ar: تصفية بالذكاء الاصطناعي في الوقت الحقيقي

# onboarding_Second_Subtitle
source: Run the Haram Filter AI model with a tap â€” get instant feedback whether you're clean or need revision.
ar: قم بتشغيل نموذج Haram Filter بلمسة واحدة — واحصل على نتيجة فورية توضح إن كان المحتوى آمنًا أو يحتاج مراجعة.

# onboarding_Third_Title
source: Privacy First
ar: الخصوصية أولًا

# onboarding_Third_Subtitle
source: All processing happens on-device, ensuring your data stays private and secure.
ar: تتم جميع المعالجات على الجهاز لضمان بقاء بياناتك خاصة وآمنة.

# welcomeTitle
source: Welcome
ar: مرحبًا بك

# homeTitle
source: Ready to build with peace of mind?
ar: جاهز للبناء براحة بال؟

# haramFilterTitle
source: Haram Filter
ar: فلتر الحرام

source: Run Haram Filter
ar: تشغيل فلتر الحرام

# aiRunning
source: AI is running
ar: الذكاء الاصطناعي قيد التشغيل

# aiRunningSubtitle
source: Please wait while the AI processes the content.
ar: يرجى الانتظار أثناء معالجة المحتوى.

source: Failed to run AI
ar: فشل في تشغيل الذكاء الاصطناعي

# stopeModel
source: Stop Haram Filter
ar: إيقاف فلتر الحرام

source: Home
ar: الرئيسية

source: Settings
ar: الإعدادات
